In [1]:
%load_ext sql

In [2]:
%%sql
mysql+pymysql://w-alkao:mysqlpassword@localhost

In [4]:
%sql SHOW DATABASES;

 * mysql+pymysql://w-alkao:***@localhost
9 rows affected.

[('ap',),
 ('ex',),
 ('goal',),
 ('information_schema',),
 ('livestock',),
 ('mysql',),
 ('om',),
 ('performance_schema',),
 ('sys',)]

In [5]:
%sql USE livestock

 * mysql+pymysql://w-alkao:***@localhost
0 rows affected.

[]

In [8]:
%sql SHOW TABLES;

 * mysql+pymysql://w-alkao:***@localhost
2 rows affected.

[('Animal',), ('Book',)]

## Index fulltext

...

In [7]:
%%sql

CREATE TABLE Book(
  id INT UNSIGNED PRIMARY KEY AUTO_INCREMENT,
  author VARCHAR(50),
  title VARCHAR(200)
)ENGINE = MyISAM;

 * mysql+pymysql://w-alkao:***@localhost
0 rows affected.

[]

In [12]:
%sql DESCRIBE Book

 * mysql+pymysql://w-alkao:***@localhost
3 rows affected.

[('id', 'int unsigned', 'NO', 'PRI', None, 'auto_increment'),
 ('author', 'varchar(50)', 'YES', '', None, ''),
 ('title', 'varchar(200)', 'YES', '', None, '')]

In [10]:
%%sql

INSERT INTO Book (author, title) VALUES
  ('Daniel Pennac', 'Au bonheur des orgres'),
  ('Daniel Pennac', 'La Fée Carabine'),
  ('Daniel Pennac', 'Comme un roman'),
  ('Daniel Pennac', 'La Petite marchande de prose'),
  ('Jacqueline Harpman', 'Le Bonheur est dans le crime'),
  ('Jacqueline Harpman', 'La Dormition des amants'),
  ('Jacqueline Harpman', 'La Plage d''Ostende'),
  ('Jacqueline Harpman', 'Histoire de Jenny'),
  ('Terry Pratchett', 'Les Petits Dieux'),
  ('Terry Pratchett', 'Le Cinquième éléphant'),
  ('Terry Pratchett', 'La Vérité'),
  ('Terry Pratchett', 'Le Dernier héros'),
  ('Terry Goodkind', 'Le Temple des vents'),
  ('Jules Verne', 'De la Terre à la Lune'),
  ('Jules Verne', 'Voyage au centre de la Terre'),
  ('Henri-Pierre Roché', 'Jules et Jim');

 * mysql+pymysql://w-alkao:***@localhost
16 rows affected.

[]

In [11]:
%sql SELECT * FROM Book

 * mysql+pymysql://w-alkao:***@localhost
16 rows affected.

[(1, 'Daniel Pennac', 'Au bonheur des orgres'),
 (2, 'Daniel Pennac', 'La Fée Carabine'),
 (3, 'Daniel Pennac', 'Comme un roman'),
 (4, 'Daniel Pennac', 'La Petite marchande de prose'),
 (5, 'Jacqueline Harpman', 'Le Bonheur est dans le crime'),
 (6, 'Jacqueline Harpman', 'La Dormition des amants'),
 (7, 'Jacqueline Harpman', "La Plage d'Ostende"),
 (8, 'Jacqueline Harpman', 'Histoire de Jenny'),
 (9, 'Terry Pratchett', 'Les Petits Dieux'),
 (10, 'Terry Pratchett', 'Le Cinquième éléphant'),
 (11, 'Terry Pratchett', 'La Vérité'),
 (12, 'Terry Pratchett', 'Le Dernier héros'),
 (13, 'Terry Goodkind', 'Le Temple des vents'),
 (14, 'Jules Verne', 'De la Terre à la Lune'),
 (15, 'Jules Verne', 'Voyage au centre de la Terre'),
 (16, 'Henri-Pierre Roché', 'Jules et Jim')]

In [13]:
%%sql # Create index full text on colum author, title, (author and title)

CREATE FULLTEXT INDEX ind_full_title
  ON Book (title);

CREATE FULLTEXT INDEX ind_full_author
  ON Book (author);

CREATE FULLTEXT INDEX ind_full_title_author
  ON Book (title, author);

 * mysql+pymysql://w-alkao:***@localhost
16 rows affected.
16 rows affected.
16 rows affected.

[]

In [14]:
%sql DESCRIBE Book

 * mysql+pymysql://w-alkao:***@localhost
3 rows affected.

[('id', 'int unsigned', 'NO', 'PRI', None, 'auto_increment'),
 ('author', 'varchar(50)', 'YES', 'MUL', None, ''),
 ('title', 'varchar(200)', 'YES', 'MUL', None, '')]

In [21]:
%%sql # search terry in author column

SELECT *
FROM Book
WHERE MATCH (author) AGAINST ('Terry')

 * mysql+pymysql://w-alkao:***@localhost
5 rows affected.

[(9, 'Terry Pratchett', 'Les Petits Dieux'),
 (10, 'Terry Pratchett', 'Le Cinquième éléphant'),
 (11, 'Terry Pratchett', 'La Vérité'),
 (12, 'Terry Pratchett', 'Le Dernier héros'),
 (13, 'Terry Goodkind', 'Le Temple des vents')]

In [33]:
%%sql

SELECT * FROM Book
WHERE MATCH (title) AGAINST ('Petite')

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[(4, 'Daniel Pennac', 'La Petite marchande de prose')]

In [25]:
%%sql

SELECT * FROM Book
WHERE MATCH (author, title) AGAINST('jules');

 * mysql+pymysql://w-alkao:***@localhost
3 rows affected.

[(14, 'Jules Verne', 'De la Terre à la Lune'),
 (16, 'Henri-Pierre Roché', 'Jules et Jim'),
 (15, 'Jules Verne', 'Voyage au centre de la Terre')]

In [28]:
%%sql 

SELECT * FROM Book
WHERE MATCH (title, author) AGAINST ('Jules Verne')

 * mysql+pymysql://w-alkao:***@localhost
3 rows affected.

[(14, 'Jules Verne', 'De la Terre à la Lune'),
 (15, 'Jules Verne', 'Voyage au centre de la Terre'),
 (16, 'Henri-Pierre Roché', 'Jules et Jim')]